CHT/heated_plate/TFFB/fluid-openfoam/system/decomposeParDict
FoamFile {
    version 2.0;
    class dictionary;
    object decomposeParDict;
    format ascii;
}

numberOfSubdomains 4;

method          scotch;
